Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_exti.h
/**
  ******************************************************************************
  * @file    py32e407_ll_exti.h
  * @author  MCU Application Team
  * @brief   Header file of EXTI LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PY32E407_LL_EXTI_H
#define __PY32E407_LL_EXTI_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32e4xx.h"

/** @addtogroup PY32E407_LL_Driver
  * @{
  */

#if defined (EXTI)

/** @defgroup EXTI_LL EXTI
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private Macros ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup EXTI_LL_Private_Macros EXTI Private Macros
  * @{
  */
/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/
/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup EXTI_LL_ES_INIT EXTI Exported Init structure
  * @{
  */
typedef struct
{

  uint32_t Line_0_31;           /*!< Specifies the EXTI lines to be enabled or disabled for Lines in range 0 to 31
                                     This parameter can be any combination of @ref EXTI_LL_EC_LINE */

  uint32_t Line_32_63;          /*!< Specifies the EXTI lines to be enabled or disabled for Lines in range 32 to 63
                                     This parameter can be any combination of @ref EXTI_LL_EC_LINE */

  FunctionalState LineCommand;  /*!< Specifies the new state of the selected EXTI lines.
                                     This parameter can be set either to ENABLE or DISABLE */

  uint8_t Mode;                 /*!< Specifies the mode for the EXTI lines.
                                     This parameter can be a value of @ref EXTI_LL_EC_MODE. */

  uint8_t Trigger;              /*!< Specifies the trigger signal active edge for the EXTI lines.
                                     This parameter can be a value of @ref EXTI_LL_EC_TRIGGER. */
} LL_EXTI_InitTypeDef;

/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup EXTI_LL_Exported_Constants EXTI Exported Constants
  * @{
  */

/** @defgroup EXTI_LL_EC_LINE LINE
  * @{
  */
#define LL_EXTI_LINE_0                 EXTI_IMR1_IMR0           /*!< Extended line 0 */
#define LL_EXTI_LINE_1                 EXTI_IMR1_IMR1           /*!< Extended line 1 */
#define LL_EXTI_LINE_2                 EXTI_IMR1_IMR2           /*!< Extended line 2 */
#define LL_EXTI_LINE_3                 EXTI_IMR1_IMR3           /*!< Extended line 3 */
#define LL_EXTI_LINE_4                 EXTI_IMR1_IMR4           /*!< Extended line 4 */
#define LL_EXTI_LINE_5                 EXTI_IMR1_IMR5           /*!< Extended line 5 */
#define LL_EXTI_LINE_6                 EXTI_IMR1_IMR6           /*!< Extended line 6 */
#define LL_EXTI_LINE_7                 EXTI_IMR1_IMR7           /*!< Extended line 7 */
#define LL_EXTI_LINE_8                 EXTI_IMR1_IMR8           /*!< Extended line 8 */
#define LL_EXTI_LINE_9                 EXTI_IMR1_IMR9           /*!< Extended line 9 */
#define LL_EXTI_LINE_10                EXTI_IMR1_IMR10          /*!< Extended line 10 */
#define LL_EXTI_LINE_11                EXTI_IMR1_IMR11          /*!< Extended line 11 */
#define LL_EXTI_LINE_12                EXTI_IMR1_IMR12          /*!< Extended line 12 */
#define LL_EXTI_LINE_13                EXTI_IMR1_IMR13          /*!< Extended line 13 */
#define LL_EXTI_LINE_14                EXTI_IMR1_IMR14          /*!< Extended line 14 */
#define LL_EXTI_LINE_15                EXTI_IMR1_IMR15          /*!< Extended line 15 */
#define LL_EXTI_LINE_16                EXTI_IMR1_IMR16          /*!< Extended line 16 */
#if defined(RTC)
#define LL_EXTI_LINE_17                EXTI_IMR1_IMR17          /*!< Extended line 17 */
#endif /* RTC */
#if defined(COMP1)
#define LL_EXTI_LINE_18                EXTI_IMR1_IMR18          /*!< Extended line 18 */
#endif /* COMP1 */
#if defined(COMP2)
#define LL_EXTI_LINE_19                EXTI_IMR1_IMR19          /*!< Extended line 19 */
#endif /* COMP2 */
#if defined(COMP3)
#define LL_EXTI_LINE_20                EXTI_IMR1_IMR20          /*!< Extended line 20 */
#endif /* COMP3 */
#if defined(COMP4)
#define LL_EXTI_LINE_21                EXTI_IMR1_IMR21          /*!< Extended line 21 */
#endif /* COMP4 */
#if defined(I2C1)
#define LL_EXTI_LINE_22                EXTI_IMR1_IMR22          /*!< Extended line 22 */
#endif /* I2C1 */
#if defined(I2C2)
#define LL_EXTI_LINE_23                EXTI_IMR1_IMR23          /*!< Extended line 23 */
#endif /* I2C2 */
#if defined(I2C3)
#define LL_EXTI_LINE_24                EXTI_IMR1_IMR24          /*!< Extended line 24 */
#endif /* I2C3 */
#if defined(I2C4)
#define LL_EXTI_LINE_25                EXTI_IMR1_IMR25          /*!< Extended line 25 */
#endif /* I2C4 */
#if defined(LPTIM1)
#define LL_EXTI_LINE_30                EXTI_IMR1_IMR30          /*!< Extended line 30 */
#endif /* LPTIM1 */
#if defined(ETH)
#define LL_EXTI_LINE_31                EXTI_IMR1_IMR31          /*!< Extended line 31 */
#endif /* ETH */
#define LL_EXTI_LINE_ALL_0_31          EXTI_IMR1_IMR            /*!< All Extended line not reserved*/

